<a href="https://colab.research.google.com/github/thepersonuadmire/sqlbasics/blob/main/sql_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.

In [ ]:
CREATE TABLE employees (
    emp_id INT NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INT CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

2. Constraints in SQL help ensure data integrity and accuracy by enforcing rules on the data stored in tables.
Some common constraints are:

NOT NULL → Ensures a column cannot have NULL values.
Example: emp_name TEXT NOT NULL

PRIMARY KEY → Uniquely identifies each record and cannot be NULL.
Example: emp_id INT PRIMARY KEY

UNIQUE → Ensures all values in a column are different.
Example: email TEXT UNIQUE

CHECK → Restricts values based on a condition.
Example: age INT CHECK (age >= 18)

DEFAULT → Assigns a default value if no value is provided.
Example: salary DECIMAL DEFAULT 30000

FOREIGN KEY → Links a column to another table’s primary key.
Example: FOREIGN KEY (dept_id) REFERENCES departments(dept_id)

3. The NOT NULL constraint ensures that essential data is always present.

Primary keys cannot contain NULL values because they uniquely identify each record. If a primary key were NULL, it wouldn't be unique.

4. Adding a Constraint

In [ ]:
ALTER TABLE employees ADD CONSTRAINT chk_salary CHECK (salary > 20000);

Removing a Constraint

In [ ]:
ALTER TABLE employees DROP CONSTRAINT chk_salary;

5. If an inserted or updated value does not meet constraints, an error occurs.
Example Error

Trying to insert an employee with age 15:

In [ ]:
INSERT INTO employees (emp_id, emp_name, age, email, salary)
VALUES (1, 'John Doe', 15, 'john@example.com', 50000);

Error: CHECK constraint failed: employees

6.

In [ ]:
ALTER TABLE products ADD CONSTRAINT pk_product PRIMARY KEY (product_id);
ALTER TABLE products ALTER COLUMN price SET DEFAULT 50.00;

7.

In [ ]:
SELECT students.student_name, classes.class_name
FROM students
INNER JOIN classes ON students.class_id = classes.class_id;

8.

In [ ]:
SELECT orders.order_id, customers.customer_name, products.product_name
FROM products
LEFT JOIN orders ON products.product_id = orders.product_id
LEFT JOIN customers ON orders.customer_id = customers.customer_id;

9.

In [ ]:
SELECT products.product_name, SUM(sales.quantity * sales.price) AS total_sales
FROM sales
INNER JOIN products ON sales.product_id = products.product_id
GROUP BY products.product_name;

10.

In [ ]:
SELECT orders.order_id, customers.customer_name, SUM(order_details.quantity) AS total_quantity
FROM orders
INNER JOIN customers ON orders.customer_id = customers.customer_id
INNER JOIN order_details ON orders.order_id = order_details.order_id
GROUP BY orders.order_id, customers.customer_name;

# ***SQL*** **Commands**

1. Primary Key: A unique identifier for each record in a table.

Foreign Key: A column that references a primary key in another table.

Example:

film(film_id PRIMARY KEY)

inventory(film_id FOREIGN KEY REFERENCES film(film_id))

In [ ]:
SELECT
    CONSTRAINT_NAME, TABLE_NAME, COLUMN_NAME
FROM information_schema.KEY_COLUMN_USAGE
WHERE TABLE_SCHEMA = 'maven_movies';

2.

In [ ]:
SELECT * FROM actor;

3.

In [ ]:
SELECT * FROM customer;

4.

In [ ]:
SELECT DISTINCT country FROM country;

5.

In [ ]:
SELECT * FROM customer WHERE active = 1;

6.

In [ ]:
SELECT rental_id FROM rental WHERE customer_id = 1;

7.

In [ ]:
SELECT * FROM film WHERE rental_duration > 5;

8.

In [ ]:
SELECT COUNT(*) FROM film WHERE replacement_cost BETWEEN 15 AND 20;

9.

In [ ]:
SELECT COUNT(DISTINCT first_name) FROM actor;

10.

In [ ]:
SELECT * FROM customer LIMIT 10;

11.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE 'B%' LIMIT 3;

12.

In [ ]:
SELECT title FROM film WHERE rating = 'G' LIMIT 5;

13.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE 'A%';

14.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE '%A';

15.

In [ ]:
SELECT city FROM city WHERE city LIKE 'A%A' LIMIT 4;

16.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE '%NI%';

17.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE '_R%';

18.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE 'A%' AND LENGTH(first_name) >= 5;

19.

In [ ]:
SELECT * FROM customer WHERE first_name LIKE 'A%O';

20.

In [ ]:
SELECT title FROM film WHERE rating IN ('PG', 'PG-13');

21.

In [ ]:
SELECT title FROM film WHERE length BETWEEN 50 AND 100;

22.

In [ ]:
SELECT * FROM actor LIMIT 50;

23.

In [ ]:
SELECT DISTINCT film_id FROM inventory;

# ***Functions***

# Basic Aggregate Functions

1.

In [ ]:
 SELECT COUNT(*) AS total_rentals FROM rental;

2.

In [ ]:
SELECT AVG(rental_duration) AS avg_rental_days FROM film;

3.

In [ ]:
SELECT UPPER(first_name) AS first_name, UPPER(last_name) AS last_name FROM customer;

4.

In [ ]:
SELECT rental_id, MONTH(rental_date) AS rental_month FROM rental;

# Group By

5.

In [ ]:
SELECT customer_id, COUNT(rental_id) AS rental_count
FROM rental
GROUP BY customer_id;

6.

In [ ]:
SELECT store_id, SUM(amount) AS total_revenue
FROM payment
GROUP BY store_id;

7.

In [ ]:
SELECT category.name AS category_name, COUNT(rental.rental_id) AS total_rentals
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN film_category ON film.film_id = film_category.film_id
JOIN category ON film_category.category_id = category.category_id
GROUP BY category.name;

8.

In [ ]:
SELECT language.name AS language, AVG(film.rental_rate) AS avg_rental_rate
FROM film
JOIN language ON film.language_id = language.language_id
GROUP BY language.name;

# Joins

9.

In [ ]:
SELECT film.title, customer.first_name, customer.last_name
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN customer ON rental.customer_id = customer.customer_id;

10.

In [ ]:
SELECT actor.first_name, actor.last_name
FROM actor
JOIN film_actor ON actor.actor_id = film_actor.actor_id
JOIN film ON film_actor.film_id = film.film_id
WHERE film.title = 'Gone with the Wind';

11.

In [ ]:
SELECT customer.first_name, customer.last_name, SUM(payment.amount) AS total_spent
FROM customer
JOIN payment ON customer.customer_id = payment.customer_id
GROUP BY customer.customer_id;

12.

In [ ]:
SELECT film.title, customer.first_name, customer.last_name
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN customer ON rental.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city ON address.city_id = city.city_id
WHERE city.city = 'London'
GROUP BY film.title, customer.first_name, customer.last_name;

# Advanced Joins and GROUP BY

13.

In [ ]:
SELECT film.title, COUNT(rental.rental_id) AS rental_count
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
GROUP BY film.title
ORDER BY rental_count DESC
LIMIT 5;

14.

In [ ]:
SELECT customer.first_name, customer.last_name
FROM rental
JOIN customer ON rental.customer_id = customer.customer_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
WHERE inventory.store_id IN (1,2)
GROUP BY customer.customer_id
HAVING COUNT(DISTINCT inventory.store_id) = 2;

# ***Windows*** ***Function***

1.

In [ ]:
SELECT customer_id, first_name, last_name,
       SUM(amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(amount) DESC) AS spending_rank
FROM customer
JOIN payment ON customer.customer_id = payment.customer_id
GROUP BY customer_id;

2.

In [ ]:
SELECT film.title, payment.payment_date,
       SUM(payment.amount) OVER (PARTITION BY film.film_id ORDER BY payment.payment_date) AS cumulative_revenue
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id;

3.

In [ ]:
SELECT film_id, title, length,
       AVG(rental_duration) OVER (PARTITION BY length) AS avg_rental_duration
FROM film;

4.

In [ ]:
SELECT category.name AS category_name, film.title,
       COUNT(rental.rental_id) AS rental_count,
       RANK() OVER (PARTITION BY category.name ORDER BY COUNT(rental.rental_id) DESC) AS rank
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN film_category ON film.film_id = film_category.film_id
JOIN category ON film_category.category_id = category.category_id
GROUP BY category.name, film.title;

5.

In [ ]:
SELECT MONTH(payment_date) AS month,
       SUM(amount) AS monthly_revenue,
       SUM(SUM(amount)) OVER (ORDER BY MONTH(payment_date)) AS running_total
FROM payment
GROUP BY MONTH(payment_date);

6.

In [ ]:
SELECT customer_id, first_name, last_name,
       SUM(amount) AS total_spent
FROM customer
JOIN payment ON customer.customer_id = payment.customer_id
GROUP BY customer_id
HAVING SUM(amount) >= (SELECT PERCENTILE_CONT(0.8) WITHIN GROUP (ORDER BY SUM(amount)) FROM payment);

7.

In [ ]:
SELECT category.name, COUNT(rental.rental_id) AS rental_count,
       SUM(COUNT(rental.rental_id)) OVER (PARTITION BY category.name ORDER BY COUNT(rental.rental_id)) AS running_total
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN film_category ON film.film_id = film_category.film_id
JOIN category ON film_category.category_id = category.category_id
GROUP BY category.name;

8.

In [ ]:
SELECT film.title, COUNT(rental.rental_id) AS rental_count
FROM rental
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN film_category ON film.film_id = film_category.film_id
GROUP BY film.title
HAVING COUNT(rental.rental_id) <
      (SELECT AVG(rental_count) FROM
       (SELECT COUNT(rental.rental_id) AS rental_count FROM rental
        JOIN inventory ON rental.inventory_id = inventory.inventory_id
        JOIN film ON inventory.film_id = film.film_id
        GROUP BY film.film_id) AS avg_rentals);

9.

In [ ]:
SELECT MONTH(payment_date) AS month, SUM(amount) AS revenue
FROM payment
GROUP BY MONTH(payment_date)
ORDER BY revenue DESC
LIMIT 5;

10.

In [ ]:
SELECT customer_id, first_name, last_name,
       COUNT(rental_id) AS total_rentals,
       COUNT(rental_id) - (SELECT AVG(total_rentals) FROM
                           (SELECT customer_id, COUNT(rental_id) AS total_rentals FROM rental GROUP BY customer_id) AS avg_rentals)
       AS rental_difference
FROM customer
JOIN rental ON customer.customer_id = rental.customer_id
GROUP BY customer_id;

# ***Normalisation*** & ***CTE***

5.

In [ ]:
WITH ActorFilmCount AS (
    SELECT actor.actor_id, actor.first_name, actor.last_name, COUNT(film_actor.film_id) AS film_count
    FROM actor
    JOIN film_actor ON actor.actor_id = film_actor.actor_id
    GROUP BY actor.actor_id
)
SELECT * FROM ActorFilmCount;

6.

In [ ]:
WITH FilmLanguage AS (
    SELECT film.title, language.name AS language, film.rental_rate
    FROM film
    JOIN language ON film.language_id = language.language_id
)
SELECT * FROM FilmLanguage;

7.

In [ ]:
WITH CustomerRevenue AS (
    SELECT customer_id, SUM(amount) AS total_revenue
    FROM payment
    GROUP BY customer_id
)
SELECT * FROM CustomerRevenue;

8.

In [ ]:
WITH FilmRanking AS (
    SELECT film_id, title, rental_duration,
           RANK() OVER (ORDER BY rental_duration DESC) AS rank
    FROM film
)
SELECT * FROM FilmRanking;

9.

In [ ]:
WITH FrequentCustomers AS (
    SELECT customer_id, COUNT(rental_id) AS total_rentals
    FROM rental
    GROUP BY customer_id
    HAVING COUNT(rental_id) > 2
)
SELECT customer.first_name, customer.last_name, total_rentals
FROM FrequentCustomers
JOIN customer ON FrequentCustomers.customer_id = customer.customer_id;

10.

In [ ]:
WITH MonthlyRentals AS (
    SELECT MONTH(rental_date) AS month, COUNT(*) AS total_rentals
    FROM rental
    GROUP BY MONTH(rental_date)
)
SELECT * FROM MonthlyRentals;

11.

In [ ]:
WITH ActorPairs AS (
    SELECT fa1.actor_id AS actor1, fa2.actor_id AS actor2, film_id
    FROM film_actor fa1
    JOIN film_actor fa2 ON fa1.film_id = fa2.film_id AND fa1.actor_id < fa2.actor_id
)
SELECT a1.first_name AS actor1, a2.first_name AS actor2, film.title
FROM ActorPairs
JOIN actor a1 ON ActorPairs.actor1 = a1.actor_id
JOIN actor a2 ON ActorPairs.actor2 = a2.actor_id
JOIN film ON ActorPairs.film_id = film.film_id;